IRP/src/Documents/TimeSheet/TimeSheet.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>TimeSheet</name>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>InformationRegister.T9520S_TimeSheetInfo</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>TimeSheetList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Date</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>EmployeeSchedule</name>
   <type>
    <types>CatalogRef.EmployeeSchedule</types>
   </type>
  </attributes>
  <attributes>
   <name>CountDaysHours</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ActuallyDaysHours</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>IsVacation</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>IsSickLeave</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/InformationRegisters/T9510S_Staffing/T9510S_Staffing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9510S_Staffing</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Fired</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <resources>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </resources>
 <resources>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </resources>
 <resources>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Documents/TimeSheet/Forms/AddEmployee/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	BeginDate = BegOfDay(Parameters.BeginDate);
	EndDate = BegOfDay(Parameters.EndDate);
	
	ResultTable = New ValueTable();
	ResultTable.Columns.Add("Employee", New TypeDescription("CatalogRef.Partners"));
	
	While BeginDate <= EndDate Do	
		ArrayOfStaffing = GetStaffing(Parameters.Company, Parameters.Branch, BeginDate);	
		For Each Row In ArrayOfStaffing Do
			If Parameters.Employees.Find(Row.Employee) <> Undefined Then
				Continue;
			EndIf;
			NewRow = ResultTable.Add();
			FillPropertyValues(NewRow, Row);
		EndDo;
		BeginDate = EndOfDay(BeginDate) + 1;
	EndDo;
	
	ResultTable.GroupBy("Employee");
	ThisObject.EmployeeTable.Load(ResultTable);
EndProcedure

&AtServer
Function GetStaffing(Company, Branch, _Day)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	StaffingSliceLast.Employee AS Employee
	|FROM
	|	InformationRegister.T9510S_Staffing.SliceLast(ENDOFPERIOD(&_Day, DAY), Company = &Company) AS StaffingSliceLast
	|		INNER JOIN InformationRegister.T9510S_Staffing.SliceLast(ENDOFPERIOD(&_Day, DAY),) AS StaffingFiredSliceLast
	|		ON (StaffingSliceLast.Employee = StaffingFiredSliceLast.Employee)
	|WHERE
	|	NOT StaffingFiredSliceLast.Fired
	|	AND StaffingSliceLast.Branch = &Branch";
	Query.SetParameter("Company", Company);
	Query.SetParameter("Branch" , Branch);
	Query.SetParameter("_Day"   , _Day);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	ArrayOfResults = New Array();
	While QuerySelection.Next() Do
		ArrayOfResults.Add(New Structure("Employee", QuerySelection.Employee));
	EndDo;
	
	Return ArrayOfResults;
EndFunction

&AtClient
Procedure EmployeeTableBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure EmployeeTableBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure CheckAll(Command)
	ChangeSelection(True);
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	ChangeSelection(False);
EndProcedure
	
&AtClient
Procedure ChangeSelection(Value)
	For Each Row In ThisObject.EmployeeTable Do
		Row.Selected = Value;
	EndDo;
EndProcedure

&AtClient
Procedure Select(Command)
	CloseWithResult();
EndProcedure

&AtClient
Procedure CloseWithResult()
	ArrayOfEmployee = New Array();
	For Each Row In ThisObject.EmployeeTable Do
		If Row.Selected Then
			ArrayOfEmployee.Add(Row.Employee);
		EndIf;
	EndDo;
	Close(New Structure("ArrayOfEmployee", ArrayOfEmployee));
EndProcedure
